change ASCII graph to mermaid
